package org.example;

public class Main {
    public static void main(String[] args) {

        System.out.println("\nდავალება 1: Main კლასის main მეთოდში შექმენით მასივი რიცხვითი\n" +
                "მნიშვნელობებით და თუ ამ მასივში არ არის ლუწი რიცხვი,\n" +
                "მაშინ დაიბეჭდოს “მასივში არ არის ლუწი რიცხვი ”. თუ ამ\n" +
                "მასივში არის ლუწი რიცხვი (მაგალითად 5 ლუწი რიცხვია)\n" +
                "მაშინ დაბეჭდოს “ამ მასივში არის 5 ლუწი რიცხვი ” → \n\nპასუხი:");


        int Numbers = 0; //ნულიდან იწყებს დათვლას

        for (int i = 0; i < 10; i = i + 2){  //იწყება loop-ი 0 დან 8-ის ჩათვლით
            System.out.println(i);  // გამოაქვს ყველა ლუწი რიცხვი
            Numbers++;   //რიცხვი გაიზრდება ყოველჯერზე, როცა ლუწ რიცხვს იპოვის.
        }
                /*if (evenNumbers > 0)
                ეს პირობა ამოწმებს არის თუ არა ლუწი რიცხვები.
                თუ ლუწი რიცხვები 0-ზე მეტია (ანუ მოიძებნა ერთი ლუწი რიცხვი მაინც),
                ის ბეჭდავს რამდენი ლუწი რიცხვია მასივში.
                თუ ლუწი რიცხვები არის 0 (ესეიგი ლუწი რიცხვები არ მოიძებნა),
                ის ბეჭდავს, რომ არ არსებობს ლუწი რიცხვები.*/
        if (Numbers > 0) {
            System.out.println("აქ არის " + Numbers + " ლუწი რიცხვი.");
        } else {
            System.out.println("აქ არ არის ლუწი რიცხვი.");
        }

        // დავალება 4
        //main კლასში გადმოვიტანე checkNumber კლასიდან.
        System.out.println("\nდავალება 4: Main კლასში შექმენით void -იანი მეთოდი სახელად\n" +
                "checkNumber, რომელიც პარამეტრად მიიღებს int ტიპის ცვლადს.\n" +
                "მეთოდმა დაბეჭდოს “დადებითი” თუ დადებით რიცხვს გადავცემთ, დაბეჭდოს \n“უარყოფითი” თუ უარყოფით რიცხვს გადავცემთ და\n" +
                "დაბეჭდოს “ნოლი” თუ 0 -ს გადავცემთ → \n\nპასუხი:");
        checkNumber.checkNumber(10); //ეს გამოიტანს პოზიტიურს
        checkNumber.checkNumber(-8); //ეს გამოიტანს ნეგატიურს
        checkNumber.checkNumber(0);  //ეს გამოიტანს ნულს

        System.out.println("\nდავალება 5: Main კლასსი შექმენით void -იანი მეთოდი სახელად hasTeen,\n" +
                "რომელიც პარამეტრად მიიღებს სამ ცალ int ტიპის ცვლადს.\n" +
                "მეთოდმა დაბეჭდოს “True” თუ რომელიმე პარამეტრი მაინც იქნება\n" +
                "მინიმუმ 13 და მაქსიმუმ 19. მეთოდმა დაბეჭდოს “False” თუ\n" +
                "არც ერთი პარამეტრი არ იქნება 13 - 19 დიაპაზონში → \n\nპასუხი:");

        hasTeen.hasTeen(12, 15, 22);  // True
        hasTeen.hasTeen(10, 20, 25);  // False
        hasTeen.hasTeen(13, 19, 7);   // True
    }

}





