package org.example;

public class While {
    public static void main(String[] args) {

        System.out.println("\nდავალება 2:  შექმნით ახალი კლასი სახელად While და while ციკლით\n" +
                "დაბეჭდეთ String -ში არსებული ყოველი მესამე სიმბოლო,\n" +
                "ანუ 3 პოზიციაზე მდგომი, შემდეგ 6 მდგომი, შემდეგ 9\n" +
                "მდგომი … თუ რომელიმე მესამე სიმბოლო იქნება პატარა z ასო, მაშინ ციკლი შეწყდეს →\n\nპასუხი:");

        String s = "I lovz Testing";

        // ეს იწყებს მესამე სიმბოლოთი
        int i = 2;

        // loop-ის განმავლობაში დაპრინტოს ყოველი მესამე სიმბოლო
        while (i < s.length()) {
            // ამოიღოს სიმბოლოები ინდექსის მიხედვით
            char C = s.charAt(i);

            // პრინტავს სიმბოლოებს
            System.out.println(C);

            // თუ შეხვდა პატარა 'z' ასო, loop-ი წყდება
            if (C == 'z') {
                break;
            }
            //გადადის ყოველ მესამეზე
            i = i + 3;
        }
    }
}
